Конфигурация/DataProcessors/ПечатьАнкетныхДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ПечатьАнкетныхДанных</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыЮридическихЛицАнкетные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыЮридическихЛицАнкетные</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КраткоеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолноеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СокращенноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КППКрупнейшегоНалогоплательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизационноПравоваяФорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизационноПравовыеФормы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиОГРН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганВыдавшийОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TIN</Name>
					<Comment>Taxpayer Identification Number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КИО</Name>
					<Comment>Код иностранной организации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЮридическийАдресФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдресФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдресФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Факсы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСтраница</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентПо173ФЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоНахождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МеждународнаяКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособСозданияМеждународнойКомпании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСозданияМеждународнойКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СтатусыЛицензий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЛицензий</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Лицензия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лицензии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ИнвестиционныеПрофили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИнвестиционныеПрофили</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвеcтиционныеЦели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантГоризонта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИнвестиционногоГоризонта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоПериодаГоризонта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеПериодаГоризонта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтносительныйСрокГоризонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубъектУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СубъектыУчета</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыСотрудниковОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыСотрудниковОрганизации</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидУдостоверенияЛичности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерияУдостоверенияЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерУдостоверенияЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиУдостоверенияЛичности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганВыдавшийУдостоверениеЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОрганаВыдавшегоУдостоверениеЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/DataProcessors/ПечатьАнкетныхДанных/Forms/ЗаявлениеОПрисоединении/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Организация", ЭтаФорма.Организация);
	Параметры.Свойство("Период"		, ЭтаФорма.Период);
	Параметры.Свойство("ЮрФизЛицо"	, ЭтаФорма.ЮрФизЛицо);
	
	ЭтаФорма.ЗаявлениеОПрисоединении = Истина;
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	СписокОбязательныхРеквизитов = ПолучитьСписокОбязательныхРеквизитов(ЭтаФорма);
	
	Если НЕ СписокОбязательныхРеквизитов.Количество() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбраны печатные формы",,,,Отказ);
	КонецЕсли;
	
	Для Каждого ОбязательныйРеквизит Из СписокОбязательныхРеквизитов Цикл
		Если ОбязательныйРеквизит.Пометка Тогда
			Если НЕ ЗначениеЗаполнено(ЭтаФорма[ОбязательныйРеквизит.Значение]) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле """ + ОбязательныйРеквизит.Представление + """ не заполнено", ЭтаФорма, ОбязательныйРеквизит.Значение, "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста	
Функция НастроитьВидимостьДоступность(Форма)

	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	//потом пригодится
	
КонецФункции

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура Печать(Команда)
	
	Отказ = Ложь;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли;
	
	ДанныеДляПечати = ПолучитьДанныеДляПечати(Отказ);

	Если НЕ Отказ Тогда
		WordApp = СоздатьОбъектWord(Ложь);
		
		Если ЗаявлениеОПрисоединении Тогда
			НапечататьДокумент(WordApp, "ЗаявлениеОПрисоединении", ДанныеДляПечати);
		КонецЕсли;
		
		WordApp.Application.Visible = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДополнтельныеФункции

&НаКлиентеНаСервереБезКонтекста	
Функция ПолучитьСписокОбязательныхРеквизитов(Форма)
	
	СписокОбязательныхРеквизитов = Новый СписокЗначений;
	
	Если Форма.ЗаявлениеОПрисоединении Тогда
		СписокОбязательныхРеквизитов.Добавить("Период"		, "Период", Истина);
		СписокОбязательныхРеквизитов.Добавить("ЮрФизЛицо"	, "Физ. лицо", Истина);
		СписокОбязательныхРеквизитов.Добавить("Подписант"	, "Подписант", Истина);
		СписокОбязательныхРеквизитов.Добавить("Стратегия"	, "Стратегия", Истина);
		СписокОбязательныхРеквизитов.Добавить("РегистрацияИнвестиционногоПрофиля", "Регистрация инвестиционного профиля");
	КонецЕсли;
	
	Возврат СписокОбязательныхРеквизитов;
	
КонецФункции


#КонецОбласти

#Область РаботаСWord

//Да тут прям на общий модуль тянет!

&НаКлиенте
Функция СоздатьОбъектWord(Visible = False)
	
	WordApp = Новый COMОбъект("Word.Application");
	WordApp.Application.Visible = Visible;

	Возврат WordApp;
	
КонецФункции

&НаКлиенте
Процедура НапечататьДокумент(WordApp, ИмяШаблона, ДанныеДляПечати)
	
	Попытка
		
		ДвоичныеДанныеШаблона = ПолучитьШаблонФайлаНаСервере(ИмяШаблона);
		ПутьКФайлуШаблона = СохранитьШаблонНаДиск(ДвоичныеДанныеШаблона);
		
		NewDoc = ДобавитьДокументWord(WordApp, ПутьКФайлуШаблона);
		ЗаполнитьПараметрыWord(NewDoc, ДанныеДляПечати, , ИмяШаблона);
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	УдалитьФайлШаблона(ПутьКФайлуШаблона);

КонецПроцедуры

&НаКлиенте
Функция ДобавитьДокументWord(WordApp, ПутьКФайлу)
	
	Возврат WordApp.Application.Documents.Add(ПутьКФайлу, Ложь, , WordApp.Application.Visible);	
	
КонецФункции

&НаКлиенте
Функция СохранитьШаблонНаДиск(ДвоичныеДанные)
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("docx");
	ДвоичныеДанные.Записать(ВременныйФайл);
	
	Возврат ВременныйФайл;

КонецФункции

&НаКлиенте
Процедура УдалитьФайлШаблона(ПутьКФайлу)
	
	// удалим файл шаблона
	Попытка
		УдалитьФайлы(ПутьКФайлу);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыWord(ДокументWord, СтруктураРеквизитов, ОбновлятьПоля = Истина, ИмяШаблона = "")
	
	WordVars = ДокументWord.Variables;
	Для каждого КлючИЗнач из СтруктураРеквизитов Цикл
		Если КлючИЗнач.Ключ = "Таблицы" Тогда
			Для каждого КлючИзначТаб из КлючИЗнач.Значение Цикл
				ЗаполнитьТаблицуWord(ДокументWord.Tables(КлючИзначТаб.Ключ), КлючИзначТаб.Значение)	
			КонецЦикла;
		ИначеЕсли КлючИЗнач.Ключ = "Опросники" Тогда
			ЗаполнитьПризнакиДокумента(ДокументWord, КлючИЗнач.Значение);
		ИначеЕсли КлючИЗнач.Ключ = "НовыеЭлементы" Тогда
			СоздатьНовыеЭлементыДокумента(ДокументWord, КлючИЗнач.Значение);
			
		ИначеЕсли ТипЗнч(КлючИЗнач.Значение) = Тип("Структура") Тогда
			ЗаполнитьПараметрыWord(ДокументWord, КлючИЗнач.Значение, Ложь);
		Иначе
			Переменная = WordVars.Item(КлючИЗнач.Ключ);
			Попытка
				Переменная.Value = Формат(КлючИЗнач.Значение, "ДФ=dd.MM.yyyy");
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Если ОбновлятьПоля Тогда
		ДокументWord.Fields.Update();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПризнакиДокумента(ДокументWord, СтруктураПризнаков)
	
	Для каждого КлючИЗнач из СтруктураПризнаков Цикл
		Попытка
			Field = ДокументWord.FormFields.Item(КлючИЗнач.Ключ);
			Field.CheckBox.Value = КлючИЗнач.Значение;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Для НомерЭлементаУправления = 1 По ДокументWord.ContentControls.Count Цикл
		ЭлементУправления = ДокументWord.ContentControls.Item(НомерЭлементаУправления);
		Если ЗначениеЗаполнено(ЭлементУправления.Tag) Тогда
			Если СтруктураПризнаков.Свойство(ЭлементУправления.Tag) Тогда
				ЭлементУправления.Checked = СтруктураПризнаков[ЭлементУправления.Tag];
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
Конецпроцедуры

&НаКлиенте
Процедура СоздатьНовыеЭлементыДокумента(ДокументWord, СтруктураЭлементов)
	
	Для Каждого Элемент Из СтруктураЭлементов Цикл
		Если ДокументWord.Bookmarks.Exists(Элемент.Ключ) Тогда //В документе должна быть закладка для вставки нового элемента
			ДокументWord.Bookmarks.Item (Элемент.Ключ).Select(); //устанавливаем курсор
			
			Для Индекс = 0 По Элемент.Значение.ВГраница() Цикл
				ОписаниеЭлемента = Элемент.Значение[Индекс];
				
				Если ОписаниеЭлемента.ТипЭлемента = "CheckBox" Тогда
					Если Индекс > 0 Тогда
						ДокументWord.Application.Selection.TypeParagraph(); //перенос строки
					КонецЕсли;
					
					Флажок = ДокументWord.Application.Selection.ContentControls.Add(8); //добавляем флажок
					Флажок.Checked = ОписаниеЭлемента.Значение;
					Флажок.SetCheckedSymbol(254, "Wingdings"); 	//символ и шрифт отметки
					Флажок.SetUncheckedSymbol(168, "Wingdings");//символ и шрифт не отметки
					
					ДокументWord.Application.Selection.MoveRight(1, 2); //двигаемся на пару символов вправо
					ДокументWord.Application.Selection.TypeText(ОписаниеЭлемента.Представление); //добавляем текст
					
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
Конецпроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуWord(ТаблицаWord, МассивСтруктур)
	
	КоличествоСтрок = ТаблицаWord.Rows.Count;
	Для каждого Структура из МассивСтруктур Цикл
		
		Если КоличествоСтрок < Структура.Строка Тогда
			Для Сч = 1 По Структура.Строка - КоличествоСтрок Цикл
				ТаблицаWord.Rows.Add();	
			КонецЦикла;
			КоличествоСтрок = Структура.Строка;
		КонецЕсли;
		
		Ячейка = ТаблицаWord.Cell(Структура.Строка, Структура.Колонка);
		Попытка
			Ячейка.Range.InsertAfter(Структура.Значение);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьШаблонФайлаНаСервере(ИмяШаблона)
	
	ОбработкаНаСервере = РеквизитФормыВЗначение("Объект"); 
	Возврат ОбработкаНаСервере.ПолучитьМакет(ИмяШаблона);
	
КонецФункции
	
#КонецОбласти

#Область ПолучениеДанных

&НаСервере
Функция ПолучитьДанныеДляПечати(Отказ)
	
	ДанныеДляПечати = Новый Структура;
	ДанныеДляПечати.Вставить("ПодписантУК"	, ПолучитьПодписанта());
	ДанныеДляПечати.Вставить("Дата"			, Формат(ЭтаФорма.Период, "ДФ='dd MMMM yyyy ''г.'''"));
	
	Анкета = Неопределено;
	
	ЗаполнитьДанныеОрганизации(ДанныеДляПечати, Отказ);
	
	Если ТипЗнч(ЭтаФорма.ЮрФизЛицо) = Тип("СправочникСсылка.ЮрФизЛица") 
		И ЭтаФорма.ЮрФизЛицо.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		Анкета = ЗаполнитьДанныеДляПечатиФизЛица(ДанныеДляПечати, Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Анкета) Тогда
		ЗаполнитьДанныеОпросников(ДанныеДляПечати, Анкета, Отказ);
	КонецЕсли;
	
	ЗаполнитьРеквизитыСтратегии(ДанныеДляПечати, Отказ);
	
	ЗаполнитьПустыеПараметры(ДанныеДляПечати);

	Возврат ДанныеДляПечати;

КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеОрганизации(ДанныеДляПечати, Отказ)
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Период",        ЭтаФорма.Период);
	Запрос.УстановитьПараметр("ЮрФизЛицо",     ЭтаФорма.Организация.ЮрФизЛицо);
	Запрос.УстановитьПараметр("Организация",   ЭтаФорма.Организация);
	
#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеПоУставу,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ОГРН КАК ОГРН,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.EMail КАК EMail,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ВебСтраница КАК ВебСтраница
		|ПОМЕСТИТЬ _РеквизитыУК
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|				И ЮрФизЛицо = &ЮрФизЛицо) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтатусыЛицензийСрезПоследних.Лицензия.ОрганВыдавшийЛицензию КАК ОрганВыдавшийЛицензию,
		|	СтатусыЛицензийСрезПоследних.Лицензия.ВидДеятельности.Наименование КАК НаименованиеВидаДеятельности,
		|	СтатусыЛицензийСрезПоследних.Лицензия.Номер КАК НомерЛицензии,
		|	СтатусыЛицензийСрезПоследних.Лицензия.ДатаВыдачи КАК ДатаВыдачиЛицензии
		|ПОМЕСТИТЬ _ЛицензияДУ
		|ИЗ
		|	РегистрСведений.СтатусыЛицензий.СрезПоследних(
		|			&Период,
		|			Лицензия.ЮрФизЛицо = &ЮрФизЛицо
		|				И Лицензия.ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами)) КАК СтатусыЛицензийСрезПоследних
		|ГДЕ
		|	СтатусыЛицензийСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов.Действует)";
#КонецОбласти
	
	Запрос.Выполнить();
	
	ВыборкаРеквизитыУК = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_РеквизитыУК").ПолучитьДанные().Выбрать();
	Если ВыборкаРеквизитыУК.Следующий() Тогда
		ДанныеДляПечати.Вставить("КраткоеНаименованиеУК"							, ВыборкаРеквизитыУК.КраткоеНаименованиеПоУставу);		
		ДанныеДляПечати.Вставить("НаименованиеУправляющейКомпании"					, ВыборкаРеквизитыУК.ПолноеНаименованиеПоУставу);		
		ДанныеДляПечати.Вставить("ОГРНУК"											, ВыборкаРеквизитыУК.ОГРН);		
		ДанныеДляПечати.Вставить("EMailУК"											, ВыборкаРеквизитыУК.EMail);		
		ДанныеДляПечати.Вставить("ВебСтраницаУК"									, ВыборкаРеквизитыУК.ВебСтраница);		
	КонецЕсли;
	
	ВыборкаЛицензияДУ = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ЛицензияДУ").ПолучитьДанные().Выбрать();
	Если ВыборкаЛицензияДУ.Следующий() Тогда
		ДанныеДляПечати.Вставить("ЛицензияДУУК",
			СтрШаблон("Лицензия профессионального участника рынка ценных бумаг %1 от %2 г. № %3, выдана %4",
				НРег(ВыборкаЛицензияДУ.НаименованиеВидаДеятельности),
				Формат(ВыборкаЛицензияДУ.ДатаВыдачиЛицензии, "ДФ=dd.MM.yyyy"),
				ВыборкаЛицензияДУ.НомерЛицензии,
				?(ВРег(ВыборкаЛицензияДУ.ОрганВыдавшийЛицензию) = "ФСФР", "ФСФР России", ВыборкаЛицензияДУ.ОрганВыдавшийЛицензию)));
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Функция ЗаполнитьДанныеДляПечатиФизЛица(ДанныеДляПечати, Отказ)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Период",      ЭтаФорма.Период);
	Запрос.УстановитьПараметр("ЮрФизЛицо",   ЭтаФорма.ЮрФизЛицо);
	Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор КАК Анкета,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия КАК Фамилия,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя КАК Имя,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество КАК Отчество,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Пол КАК Пол,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаРождения КАК ДатаРождения,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ИНН КАК ИНН,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ВидУдостоверенияЛичности КАК ВидУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.СерияУдостоверенияЛичности КАК СерияУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.НомерУдостоверенияЛичности КАК НомерУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаВыдачиУдостоверенияЛичности КАК ДатаВыдачиУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ОрганВыдавшийУдостоверениеЛичности КАК ОрганВыдавшийУдостоверениеЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.КодОрганаВыдавшегоУдостоверениеЛичности КАК КодОрганаВыдавшегоУдостоверениеЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.РезидентРФ КАК РезидентРФ,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Гражданство КАК Гражданство,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ВтороеГражданство КАК ВтороеГражданство,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.СНИЛС КАК СНИЛС,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.МестоРождения КАК МестоРождения,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ОГРНИП КАК ОГРНИП,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаВыдачиОГРНИП КАК ДатаВыдачиОГРНИП,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ОрганВыдавшийОГРНИП КАК ОрганВыдавшийОГРНИП,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.АдресРегистрации КАК АдресРегистрации,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.АдресМестаЖительства КАК АдресМестаЖительства,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ПочтовыйАдрес КАК ПочтовыйАдрес,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.EMail КАК EMail,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Телефоны КАК Телефоны,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор.НалоговыйРезидентИностранногоГосударства КАК НалоговыйРезидентИностранногоГосударства,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор.РезидентПо173ФЗ КАК РезидентПо173ФЗ,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор.РаспространениеЗаконодательстваСША КАК РаспространениеЗаконодательстваСША,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор.ИностранныйНалогоплательщик КАК ИностранныйНалогоплательщик,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор.СогласиеНаПередачуИнформации КАК СогласиеНаПередачуИнформации,
		|	ВЫБОР
		|		КОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор.НалоговыйРезидентИностранногоГосударстваГосударство = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
		|			ТОГДА ""				""
		|		ИНАЧЕ РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор.НалоговыйРезидентИностранногоГосударстваГосударство.Наименование
		|	КОНЕЦ КАК НалоговыйРезидентИностранногоГосударстваГосударство,
		|	ВЫБОР
		|		КОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор.ИностранныйНалогоплательщикГосударство = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
		|			ТОГДА ""				""
		|		ИНАЧЕ РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор.ИностранныйНалогоплательщикГосударство.Наименование
		|	КОНЕЦ КАК ИностранныйНалогоплательщикГосударство,
		|	ВЫБОР
		|		КОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор.ИностранныйНалогоплательщикОснования = """"
		|			ТОГДА ""				""
		|		ИНАЧЕ РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор.ИностранныйНалогоплательщикОснования
		|	КОНЕЦ КАК ИностранныйНалогоплательщикОснования,
		|	ВЫБОР
		|		КОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор.ФИОАгента = """"
		|			ТОГДА "" ""
		|		ИНАЧЕ РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор.ФИОАгента
		|	КОНЕЦ КАК ФИОАгента,
		|	ВЫБОР
		|		КОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор.ДолжностьАгента = """"
		|			ТОГДА "" ""
		|		ИНАЧЕ РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор.ДолжностьАгента
		|	КОНЕЦ КАК ДолжностьАгента,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Период КАК ДатаЗаполнения,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор.СреднемесячныеДоходы КАК СреднемесячныеДоходы,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор.СреднемесячныеРасходы КАК СреднемесячныеРасходы,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор.Накопления КАК Накопления,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор.ИнвестОпыт КАК ИнвестОпыт,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор.СтоимостьИмущества КАК СтоимостьИмущества,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор.КодовоеСлово КАК КодовоеСлово
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ЮрФизЛицо = &ЮрФизЛицо
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Для каждого Колонка из Результат.Колонки Цикл
		ДанныеДляПечати.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеДляПечати, Выборка);
	Иначе
		ВызватьИсключение "Не найдена анкета для физического лица " + ЭтаФорма.ЮрФизЛицо;
	КонецЕсли;
	
	// Добавление страны в адрес
	// сделаем интеллектуально, будем добавлять слово "Россия", если его нет в адресе.
	Если ЗначениеЗаполнено(ДанныеДляПечати.АдресРегистрации) Тогда
		Если НЕ СтрНачинаетсяС(ВРег(ДанныеДляПечати.АдресРегистрации), "РОССИЯ") Тогда  
			ДанныеДляПечати.АдресРегистрации = "РОССИЯ, " + ДанныеДляПечати.АдресРегистрации;	
		КонецЕсли;
	КонецЕсли;	
	Если ЗначениеЗаполнено(ДанныеДляПечати.АдресМестаЖительства) Тогда
		Если НЕ СтрНачинаетсяС(ВРег(ДанныеДляПечати.АдресМестаЖительства), "РОССИЯ") Тогда  
			ДанныеДляПечати.АдресМестаЖительства = "РОССИЯ, " + ДанныеДляПечати.АдресМестаЖительства;	
		КонецЕсли;
	КонецЕсли;	
	
	Анкета = Выборка.Анкета;
	
	СтруктураРеквизитов = Новый Структура("НомерСчета, ЛицевойСчет, ПолучательПлатежа, НаименованиеБанка, БИК, ИННПолучателя, КоррСчет, РасчетныйСчет");
	Если Анкета.БанковскиеРеквизиты.Количество() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов,  Анкета.БанковскиеРеквизиты[0]);
	КонецЕсли;
		
	ДанныеДляПечати.Вставить("РеквизитыПлатежа", ПолучитьБанковскиеРеквизиты(СтруктураРеквизитов));
	
	Возврат Анкета;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРеквизитыСтратегии(ДанныеДляПечати, Отказ)
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация"	, ЭтаФорма.Организация);
	Запрос.УстановитьПараметр("Стратегия"	, ЭтаФорма.Стратегия);
	Запрос.УстановитьПараметр("Период"		, ЭтаФорма.Период);

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтратегииИндивидуальногоИнвестирования.Ссылка КАК Стратегия,
		|	ИнвестиционныеПрофилиСрезПоследних.Регистратор КАК РегистрацияИнвестиционногоПрофиля,
		|	ИнвестиционныеПрофилиСрезПоследних.ВариантГоризонта КАК ВариантГоризонта,
		|	ИнвестиционныеПрофилиСрезПоследних.НачалоПериодаГоризонта КАК НачалоПериодаГоризонта,
		|	ИнвестиционныеПрофилиСрезПоследних.ОкончаниеПериодаГоризонта КАК ОкончаниеПериодаГоризонта,
		|	ИнвестиционныеПрофилиСрезПоследних.ОтносительныйСрокГоризонта КАК ОтносительныйСрокГоризонта,
		|	ИнвестиционныеПрофилиСрезПоследних.Цель.ОжидаемаяДоходностьВПроцентах КАК ОжидаемаяДоходность,
		|	ИнвестиционныеПрофилиСрезПоследних.Цель.ДопустимыйРиск КАК ДопустимыйРиск,
		|	ИнвестиционныеПрофилиСрезПоследних.Цель.ДопустимыйРискВПроцентах КАК ДопустимыйРискВПроцентах
		|ПОМЕСТИТЬ _ДанныеВыбраннойСтратегии
		|ИЗ
		|	Справочник.СтратегииИндивидуальногоИнвестирования КАК СтратегииИндивидуальногоИнвестирования
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнвестиционныеПрофили.СрезПоследних(&Период, Организация = &Организация) КАК ИнвестиционныеПрофилиСрезПоследних
		|		ПО СтратегииИндивидуальногоИнвестирования.Ссылка = ИнвестиционныеПрофилиСрезПоследних.СубъектУчета
		|ГДЕ
		|	СтратегииИндивидуальногоИнвестирования.Ссылка = &Стратегия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтратегииИндивидуальногоИнвестирования.Наименование КАК Наименование,
		|	_ДанныеВыбраннойСтратегии.Стратегия = СтратегииИндивидуальногоИнвестирования.Ссылка КАК Отметка
		|ПОМЕСТИТЬ _ВсеСтратегии
		|ИЗ
		|	_ДанныеВыбраннойСтратегии КАК _ДанныеВыбраннойСтратегии
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтратегииИндивидуальногоИнвестирования КАК СтратегииИндивидуальногоИнвестирования
		|		ПО (СтратегииИндивидуальногоИнвестирования.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица))
		|			И (НЕ СтратегииИндивидуальногоИнвестирования.ПометкаУдаления)";
	
	Запрос.Выполнить();
	
	ДанныеВыбраннойСтратегии = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ДанныеВыбраннойСтратегии").ПолучитьДанные().Выбрать();
	
	ДанныеВыбраннойСтратегии.Следующий();
	
	КонтрольНаличияДанных(ДанныеВыбраннойСтратегии, "РегистрацияИнвестиционногоПрофиля", Отказ);
	
	ДанныеДляПечати.Вставить("ОжидаемаяДоходность"		, Строка(ДанныеВыбраннойСтратегии.ОжидаемаяДоходность) + " % годовых");
	
	ДанныеДляПечати.Вставить("ДопустимыйРиск"			, ?(ЗначениеЗаполнено(ДанныеВыбраннойСтратегии.ДопустимыйРиск), ДанныеВыбраннойСтратегии.ДопустимыйРиск, Строка(ДанныеВыбраннойСтратегии.ДопустимыйРискВПроцентах) + " %"));
	
	Если ДанныеВыбраннойСтратегии.ВариантГоризонта = Перечисления.ВариантыИнвестиционногоГоризонта.ИнтервалДат Тогда
		ДанныеДляПечати.Вставить("ИнвестиционныйГоризонт", ПредставлениеПериода(ДанныеВыбраннойСтратегии.НачалоПериодаГоризонта, ДанныеВыбраннойСтратегии.ОкончаниеПериодаГоризонта));
	ИначеЕсли ДанныеВыбраннойСтратегии.ВариантГоризонта = Перечисления.ВариантыИнвестиционногоГоризонта.КоличествоЛетСДатыЗаключенияДоговора
		ИЛИ ДанныеВыбраннойСтратегии.ВариантГоризонта = Перечисления.ВариантыИнвестиционногоГоризонта.КоличествоЛетСДатыРегистрацииПрофиля Тогда
		ДанныеДляПечати.Вставить("ИнвестиционныйГоризонт", 
			СтрокаСЧислом(";%1 год;;%1 года; %1 лет;%1 года",
				ДанныеВыбраннойСтратегии.ОтносительныйСрокГоризонта,
				ВидЧисловогоЗначения.Количественное,
				"L=ru"));
	КонецЕсли;
	
	ВсеСтратегии = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ВсеСтратегии").ПолучитьДанные().Выгрузить();
	ВсеСтратегии.Сортировать("Наименование");
	
	Для Каждого СтрокаСтратегия Из ВсеСтратегии Цикл	
		ДобавитьНовыйЭлемент(ДанныеДляПечати, "Стратегии", "CheckBox", СтрокаСтратегия.Наименование, СтрокаСтратегия.Отметка);	
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОпросников(ДанныеДляПечати, Анкета, Отказ)
	
	Опросники = Новый Структура;
	
	Если ТипЗнч(Анкета) = Тип("ДокументСсылка.АнкетаФизическогоЛица") Тогда
		
		Опросники.Вставить("ЯвляетсяНРРФ",		ДанныеДляПечати.РезидентРФ);
		Опросники.Вставить("НеЯвляетсяНРРФ",	Не ДанныеДляПечати.РезидентРФ);
		
		Опросники.Вставить("ЯвляетсяРФЗ173",	ДанныеДляПечати.РезидентПо173ФЗ);
		Опросники.Вставить("НеЯвляетсяРФЗ173",	Не ДанныеДляПечати.РезидентПо173ФЗ);
		
		Опросники.Вставить("УказанСпособМестоПолученияОтчетности"	,  ЗначениеЗаполнено(Анкета.СпособМестоПолученияОтчетности));
		Опросники.Вставить("НЕУказанСпособМестоПолученияОтчетности"	,  НЕ ЗначениеЗаполнено(Анкета.СпособМестоПолученияОтчетности));
		
		Опросники.Вставить("НаличиеИнвестОпыта"		,  ДанныеДляПечати.ИнвестОпыт);
		Опросники.Вставить("НеНаличиеИнвестОпыта"	,  НЕ ДанныеДляПечати.ИнвестОпыт);
		
	КонецЕсли;
	
	ДанныеДляПечати.Вставить("Опросники", Опросники);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНовыйЭлемент(ДанныеДляПечати, ИмяГруппы, ТипЭлемента, Представление, Значение)
	
	Если НЕ ДанныеДляПечати.Свойство("НовыеЭлементы") Тогда
		ДанныеДляПечати.Вставить("НовыеЭлементы", Новый Структура);
	КонецЕсли;
	
	Если НЕ ДанныеДляПечати.НовыеЭлементы.Свойство(ИмяГруппы) Тогда
		ДанныеДляПечати.НовыеЭлементы.Вставить(ИмяГруппы, Новый Массив);
	КонецЕсли;
	
	ДанныеДляПечати.НовыеЭлементы[ИмяГруппы].Добавить(
		Новый Структура("ТипЭлемента, Представление, Значение", 
			ТипЭлемента, 
			Представление, 
			Значение));
			
КонецПроцедуры

&НаСервере
Функция ПолучитьБанковскиеРеквизиты(СтруктураРеквизитов)
	
	ДанныеДляПечатиБанковскихРеквизитов = Новый Структура;
		
	ДанныеДляПечатиБанковскихРеквизитов.Вставить("БанковскиеРеквизиты",
		СокрЛП(СтруктураРеквизитов.ПолучательПлатежа) 
		+ ", " + СокрЛП(СтруктураРеквизитов.НаименованиеБанка)	
		+ ", БИК " + СокрЛП(СтруктураРеквизитов.БИК)	
		+ ", ИНН " + СокрЛП(СтруктураРеквизитов.ИННПолучателя)	
		+ ", к/с " + СокрЛП(СтруктураРеквизитов.КоррСчет)	
		+ ", р/с " + СокрЛП(СтруктураРеквизитов.РасчетныйСчет)
		+ ?(ЗначениеЗаполнено(СтруктураРеквизитов.ЛицевойСчет), ", л/с " + СокрЛП(СтруктураРеквизитов.ЛицевойСчет), ""));	
	
	ДанныеДляПечатиБанковскихРеквизитов.Вставить("НаименованиеПолучателя", СокрЛП(СтруктураРеквизитов.ПолучательПлатежа));
	ДанныеДляПечатиБанковскихРеквизитов.Вставить("НаименованиеБанка",      СокрЛП(СтруктураРеквизитов.НаименованиеБанка));
	ДанныеДляПечатиБанковскихРеквизитов.Вставить("НомерСчета",             СокрЛП(СтруктураРеквизитов.НомерСчета));
	ДанныеДляПечатиБанковскихРеквизитов.Вставить("ЛицевойСчет",            СокрЛП(СтруктураРеквизитов.ЛицевойСчет));
	ДанныеДляПечатиБанковскихРеквизитов.Вставить("БИК",                    СокрЛП(СтруктураРеквизитов.БИК));
	ДанныеДляПечатиБанковскихРеквизитов.Вставить("КоррСчет",               СокрЛП(СтруктураРеквизитов.КоррСчет));
	
	ДанныеДляПечатиБанковскихРеквизитов.Вставить("ГородБанка", "");
	ДанныеДляПечатиБанковскихРеквизитов.Вставить("ИННБанка",   "");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Банки.Город КАК ГородБанка,
	|	РеквизитыЮридическихЛицСрезПоследних.ИНН КАК ИННБанка
	|ИЗ
	|	Справочник.Банки КАК Банки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
	|				,
	|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
	|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
	|		ПО Банки.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
	|ГДЕ
	|	Банки.Код = &БИК");
	
	Запрос.УстановитьПараметр("БИК", СтруктураРеквизитов.БИК);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеДляПечатиБанковскихРеквизитов, Выборка);	
	КонецЕсли;

	Возврат ДанныеДляПечатиБанковскихРеквизитов;
	
КонецФункции

&НаСервере
Функция ПолучитьПодписанта()
	
	ТекстПодписант = "____________";
	
	Если ЗначениеЗаполнено(ЭтаФорма.Подписант) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РеквизитыСотрудниковОрганизации.Фамилия КАК Фамилия,
			|	РеквизитыСотрудниковОрганизации.Имя КАК Имя,
			|	РеквизитыСотрудниковОрганизации.Отчество КАК Отчество,
			|	КонтактныеЛица.Должность КАК Должность,
			|	КонтактныеЛица.ОснованиеПолномочий КАК ОснованиеПолномочий
			|ИЗ
			|	РегистрСведений.РеквизитыСотрудниковОрганизации.СрезПоследних(
			|			&Период,
			|			Организация = &Организация
			|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
			|				И ЮрФизЛицо = &Подписант) КАК РеквизитыСотрудниковОрганизации
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактныеЛица КАК КонтактныеЛица
			|		ПО (КонтактныеЛица.КонтактноеЛицо = РеквизитыСотрудниковОрганизации.ЮрФизЛицо)
			|			И (КонтактныеЛица.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний))
			|			И (КонтактныеЛица.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
			|			И (КонтактныеЛица.Объект = &Организация)";
		
		Запрос.УстановитьПараметр("Период",        ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("Организация",   ЭтаФорма.Организация.ЮрФизЛицо);
		Запрос.УстановитьПараметр("Подписант", 	   ЭтаФорма.Подписант);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЧастиПодписанта = Новый Массив;
			ЧастиПодписанта.Добавить(Выборка.Фамилия);
			ЧастиПодписанта.Добавить(Лев(Выборка.Имя, 1) + ".");
			
			Если ЗначениеЗаполнено(Выборка.Отчество) Тогда
				ЧастиПодписанта.Добавить(Лев(Выборка.Отчество, 1) + ".");
			КонецЕсли;
			
			ЧастиПодписанта.Добавить(",");
			ЧастиПодписанта.Добавить(СокрЛП(Выборка.Должность));
			
			ТекстПодписант = СтрСоединить(ЧастиПодписанта, Символы.НПП);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТекстПодписант;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПустыеПараметры(ДанныеДляПечати)
	
	Для каждого КлючИЗнач из ДанныеДляПечати Цикл
		
		Если ТипЗнч(КлючИЗнач.Значение) = Тип("ТаблицаЗначений") Тогда
			Продолжить;
		ИначеЕсли ТипЗнч(КлючИЗнач.Значение) = Тип("Структура") Тогда
			ЗаполнитьПустыеПараметры(КлючИЗнач.Значение);
			Продолжить;
		ИначеЕсли КлючИЗнач.Значение = " " ИЛИ КлючИЗнач.Значение = "				" Тогда
			Продолжить;
		ИначеЕсли Найти(КлючИЗнач.Значение, "УпрощеннаяИдентификация") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(КлючИЗнач.Значение) Тогда
			ДанныеДляПечати.Вставить(КлючИЗнач.Ключ, "–"); // Здесь "длинное" тире. Скопировано из Word.
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура КонтрольНаличияДанных(Источник, ИмяРеквизита, Отказ)
	
	НайденныйЭлемент = ПолучитьСписокОбязательныхРеквизитов(ЭтаФорма).НайтиПоЗначению(ИмяРеквизита);
	Если НайденныйЭлемент <> Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(Источник[ИмяРеквизита]) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон("Для договора %1 не указан(а) %2", 
				ЭтаФорма.СчетДоверительногоУправления,
				НРег(НайденныйЭлемент.Представление)),,,, Отказ);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
